Repository: Coboy16/mobile-temp
Catalog: lib/core/l10n/app_*.arb
Languages: fr

source: Select Language
fr: Sélectionner la langue

# languageEnglish
source: English
fr: Anglais

# languageSpanish
source: Spanish
fr: Espagnol

# languageFrench
source: French
fr: Français

# loginTitle
source: Sign In
fr: Se connecter

# registerTitle
source: Create Account
fr: Créer un compte

# forgotPasswordEmailTitle
source: Recover Password
fr: Récupérer le mot de passe

# forgotPasswordOtpTitle
source: Verify Code
fr: Vérifier le code

# loginSubtitle
source: Enter your credentials to access the system
fr: Entrez vos identifiants pour accéder au système

# registerSubtitle
source: Complete the form to join Ho-Tech
fr: Complétez le formulaire pour rejoindre Ho-Tech

# forgotPasswordEmailSubtitle
source: Enter your email to send a recovery code.
fr: Entrez votre e-mail pour envoyer un code de récupération.

# forgotPasswordOtpSubtitle
source: Ingresa el código de 6 dígitos enviado a {emailAddress}.
fr: Entrez le code à 6 chiffres envoyé à {emailAddress}.

# copyrightNotice
source: © {year} Ho-Tech. All rights reserved.
fr: © {year} Ho-Tech. Tous droits réservés.

# loadingMessage
source: Loading...
fr: Chargement...

# validationSuccessMessage
source: Validation successful. Please continue with the process.
fr: Validation réussie. Veuillez poursuivre le processus.

# yourEmailFallback
source: your email
fr: votre e-mail

# errorDialogTitle
source: Error
fr: Erreur

# userBlockedDialogTitle
source: Account Locked
fr: Compte Bloqué

# userBlockedDialogMessage
source: Your account has been temporarily locked. Please try again in {minutes} minutes.
fr: Votre compte a été temporairement bloqué. Veuillez réessayer dans {minutes} minutes.

# userAccountBlockedGeneric
source: Your account is currently locked. Please try again later.
fr: Votre compte est bloqué. Veuillez réessayer plus tard.

# okButtonLabel
source: OK
fr: Accepter

# confirmLogoutDialogTitle
source: Confirm Logout
fr: Confirmer la Déconnexion

# confirmLogoutDialogMessage
source: Are you sure you want to log out?
fr: Êtes-vous sûr de vouloir vous déconnecter ?

# cancelButtonLabel
source: Cancel
fr: Annuler

# logoutButtonLabel
source: Log Out
fr: Se Déconnecter

# loggingOutMessage
source: Logging out...
fr: Déconnexion en cours...

# registrationErrorDialogTitle
source: Registration Error
fr: Erreur d'Inscription

# leftPanelLoginTitle
source: Welcome to Ho-Tech
fr: Bienvenue chez Ho-Tech

# leftPanelLoginSubtitle
source: Comprehensive platform for human resources management in hotel sector companies.
fr: Plateforme complète pour la gestion des ressources humaines dans les entreprises du secteur hôtelier.

# leftPanelLoginHighlight1Title
source: Request Management
fr: Gestion des demandes

# leftPanelLoginHighlight1Description
source: Manage all types of requests from a single place.
fr: Gérez tous types de demandes depuis un seul endroit.

# leftPanelLoginHighlight2Title
source: Personnel Administration
fr: Administration du personnel

# leftPanelLoginHighlight2Description
source: Hiring, evaluations, training, and more.
fr: Embauches, évaluations, formations et plus encore.

# leftPanelLoginHighlight3Title
source: Reports and Analysis
fr: Rapports et Analyses

# leftPanelLoginHighlight3Description
source: Metrics and indicators to make better decisions.
fr: Métriques et indicateurs pour prendre de meilleures décisions.

# leftPanelRegisterTitle
source: Join Ho-Tech
fr: Rejoignez Ho-Tech

# leftPanelRegisterSubtitle
source: Register to access simplified and efficient hotel management.
fr: Inscrivez-vous pour accéder à une gestion hôtelière simplifiée et efficace.

# leftPanelRegisterHighlight1Title
source: Quick Registration
fr: Inscription Rapide

# leftPanelRegisterHighlight1Description
source: Create your account in a few steps and start transforming your management.
fr: Créez votre compte en quelques étapes et commencez à transformer votre gestion.

# leftPanelRegisterHighlight2Title
source: Guaranteed Security
fr: Sécurité Garantie

# leftPanelRegisterHighlight2Description
source: Your data is protected with the highest standards.
fr: Vos données sont protégées avec les plus hauts standards.

# leftPanelRegisterHighlight3Title
source: Immediate Access
fr: Accès Immédiat

# leftPanelRegisterHighlight3Description
source: Once registered, explore all the functionalities that Ho-Tech offers you.
fr: Une fois inscrit, explorez toutes les fonctionnalités que Ho-Tech vous offre.

# leftPanelForgotPasswordTitle
source: Recover Your Access
fr: Récupérez Votre Accès

# leftPanelForgotPasswordSubtitle
source: Follow the steps to reset your password and efficiently manage your human resources again.
fr: Suivez les étapes pour réinitialiser votre mot de passe et gérer à nouveau efficacement vos ressources humaines.

# leftPanelForgotPasswordHighlight1Title
source: Secure Verification
fr: Vérification Sécurisée

# leftPanelForgotPasswordHighlight1Description
source: Enter your email to receive a verification code and protect your account.
fr: Entrez votre e-mail pour recevoir un code de vérification et protéger votre compte.

# leftPanelForgotPasswordHighlight2Title
source: Easy Reset
fr: Réinitialisation Facile

# leftPanelForgotPasswordHighlight2Description
source: With the OTP code, you can create a new password quickly and securely.
fr: Avec le code OTP, vous pourrez créer un nouveau mot de passe rapidement et en toute sécurité.

# leftPanelForgotPasswordHighlight3Title
source: Continuous Support
fr: Support Continu

# leftPanelForgotPasswordHighlight3Description
source: If you have problems, our support team is ready to help you.
fr: Si vous avez des problèmes, notre équipe de support est prête à vous aider.

# forgotPasswordEmailFormLabel
source: Email address
fr: Adresse e-mail

# forgotPasswordEmailFormHint
source: Enter your email address
fr: Entrez votre adresse e-mail

# forgotPasswordEmailFormErrorRequired
source: Email is required
fr: L'e-mail est requis

# forgotPasswordEmailFormErrorInvalid
source: Enter a valid email
fr: Entrez un e-mail valide

# forgotPasswordEmailFormSubmitButton
source: Send recovery code
fr: Envoyer le code de récupération

# forgotPasswordEmailFormBackToLoginButton
source: Back to Sign In
fr: Retour à la connexion

# forgotPasswordOtpFormValidatorError
source: The code must be 6 digits
fr: Le code doit comporter 6 chiffres

# forgotPasswordOtpFormSubmitButton
source: Verify Code
fr: Vérifier le code

# forgotPasswordOtpFormDidNotReceiveCode
source: Didn't receive the code?
fr: Vous n'avez pas reçu le code ?

# forgotPasswordOtpFormResendCodeButton
source: Resend code
fr: Renvoyer le code

# forgotPasswordOtpFormEnterDifferentEmailButton
source: Enter a different email
fr: Saisir un autre e-mail

# loginFormUsernameLabel
source: Username
fr: Nom d'utilisateur

# loginFormUsernameHint
source: Enter your username
fr: Entrez votre nom d'utilisateur

# loginFormUsernameErrorRequired
source: Username is required
fr: Le nom d'utilisateur est requis

# loginFormPasswordLabel
source: Password
fr: Mot de passe

# loginFormPasswordHint
source: Enter your password
fr: Entrez votre mot de passe

# loginFormPasswordErrorRequired
source: Password is required
fr: Le mot de passe est requis

# loginFormPasswordErrorMinLength
source: Password must be at least 6 characters
fr: Le mot de passe doit comporter au moins 6 caractères

# loginFormForgotPasswordButton
source: Forgot your password?
fr: Mot de passe oublié ?

# loginFormLoginButton
source: Sign In
fr: Se connecter

# loginFormLoginWithGoogleButton
source: Sign In with Google
fr: Se connecter avec Google

# loginFormNoAccountPrompt
source: Don't have an account?
fr: Vous n'avez pas de compte ?

# loginFormCreateAccountButton
source: Create account
fr: Créer un compte

# otpFormValidatorError
source: The code must be 6 digits
fr: Le code doit comporter 6 chiffres

# otpFormDefaultSubmitButton
source: Verify Code
fr: Vérifier le code

# otpFormDidNotReceiveCodePrompt
source: Didn't receive the code?
fr: Vous n'avez pas reçu le code ?

# otpFormDefaultResendButton
source: Resend code
fr: Renvoyer le code

# registerFormFirstNameLabel
source: First Name
fr: Prénoms

# registerFormFirstNameHint
source: Enter your first name
fr: Entrez vos prénoms

# registerFormFirstNameErrorRequired
source: First name is required
fr: Les prénoms sont requis

# registerFormPaternalLastNameLabel
source: Paternal Last Name
fr: Nom de famille paternel

# registerFormPaternalLastNameHint
source: Enter your paternal last name
fr: Entrez votre nom de famille paternel

# registerFormPaternalLastNameErrorRequired
source: Paternal last name is required
fr: Le nom de famille paternel est requis

# registerFormMaternalLastNameLabel
source: Maternal Last Name
fr: Nom de famille maternel

# registerFormMaternalLastNameHint
source: Enter your maternal last name
fr: Entrez votre nom de famille maternel

# registerFormMaternalLastNameErrorRequired
source: Maternal last name is required
fr: Le nom de famille maternel est requis

# registerFormEmailHint
source: Enter your email
fr: Entrez votre e-mail

# registerFormEmailErrorRequired
source: Email is required
fr: L'e-mail est requis

# registerFormEmailErrorInvalid
source: Enter a valid email
fr: Entrez un e-mail valide

# registerFormPasswordLabel
source: Password
fr: Mot de passe

# registerFormPasswordHint
source: Enter your password
fr: Entrez votre mot de passe

# registerFormPasswordErrorRequired
source: Password is required
fr: Le mot de passe est requis

# registerFormPasswordErrorMinLength
source: Minimum 8 characters
fr: Minimum 8 caractères

# registerFormPasswordErrorUppercase
source: Must contain at least one uppercase letter
fr: Doit contenir au moins une majuscule

# registerFormPasswordErrorDigit
source: Must contain at least one digit
fr: Doit contenir au moins un chiffre

# registerFormPasswordErrorSpecialChar
source: Must contain at least one special character
fr: Doit contenir au moins un caractère spécial

# registerFormConfirmPasswordLabel
source: Confirm Password
fr: Confirmer le mot de passe

# registerFormConfirmPasswordHint
source: Re-enter your password
fr: Retapez votre mot de passe

# registerFormConfirmPasswordErrorRequired
source: Confirm your password
fr: Confirmez votre mot de passe

# registerFormConfirmPasswordErrorMismatch
source: Passwords do not match
fr: Les mots de passe ne correspondent pas

# registerFormContinueButton
source: Continue
fr: Continuer

# registerFormCreateAccountWithGoogleButton
source: Create account with Google
fr: Créer un compte avec Google

# registerFormAlreadyHaveAccountPrompt
source: Already have an account?
fr: Vous avez déjà un compte ?

# registerFormLoginButton
source: Sign In
fr: Se connecter

# formValidationCompleteCorrectly
source: Please complete the form correctly.
fr: Veuillez remplir correctement le formulaire.

# googleSignInCancelled
source: Google sign-in cancelled by user.
fr: Connexion avec Google annulée par l'utilisateur.

# registerWithGoogleSuccessMessage
source: Registration with Google successful! Logging you in...
fr: Inscription avec Google réussie ! Connexion en cours...

# otpVerificationSuccessMessageRegister
source: OTP verified successfully. Proceeding with registration...
fr: OTP vérifié avec succès. Procédure d'inscription en cours...

# otpResendSuccessMessage
source: A new OTP has been resent to {email}.
fr: Un nouveau code OTP a été envoyé à {email}.

# registrationCompleteMessage
source: Registration complete! Logging you in...
fr: Inscription terminée ! Connexion en cours...

# autoLoginFailedMessage
source: Automatic login failed
fr: Échec de la connexion automatique

# autoLoginFailedAfterRegisterMessage
source: Failed to log in after registration
fr: Échec de la connexion après l'inscription

# autoLoginFailedAfterGoogleRegisterMessage
source: Failed to log in with Google after registration
fr: Échec de la connexion avec Google après l'inscription

# otpVerificationDescriptionForRegistration
source: We've sent a verification code to your email {email}. Please enter it below to complete your registration.
fr: Nous avons envoyé un code de vérification à votre adresse e-mail {email}. Veuillez le saisir ci-dessous pour finaliser votre inscription.

# otpVerificationButtonForRegistration
source: Verify & Register
fr: Vérifier et S'inscrire

# otpVerificationResendButtonForRegistration
source: Resend Code
fr: Renvoyer le Code

# otpRequestLoadingMessage
source: Requesting OTP...
fr: Demande de l'OTP en cours...

# otpVerificationLoadingMessage
source: Verifying OTP...
fr: Vérification de l'OTP en cours...

# registerLoadingMessage
source: Registering user...
fr: Enregistrement de l'utilisateur en cours...

# loginLoadingMessage
source: Logging in...
fr: Connexion en cours...

# otpSentSuccessMessage
source: OTP sent successfully to {email}.
fr: OTP envoyé avec succès à {email}.

# errorEmailNotProvidedMessage
source: Error: Email not provided for OTP verification.
fr: Erreur : Aucune adresse e-mail fournie pour la vérification OTP.

# otpVerificationSuccessMessage
source: OTP verified successfully!
fr: OTP vérifié avec succès !

# passwordChangeSuccessMessage
source: Password changed successfully! Please log in.
fr: Mot de passe changé avec succès ! Veuillez vous connecter.

# newPasswordFormTitleFor
source: Set New Password for {email}
fr: Définir un nouveau mot de passe pour {email}

# newPasswordFormNewLabel
source: New Password
fr: Nouveau mot de passe

# newPasswordFormNewHint
source: Enter your new password
fr: Entrez votre nouveau mot de passe

# newPasswordFormNewErrorRequired
source: New password is required
fr: Le nouveau mot de passe est requis

# newPasswordFormConfirmLabel
source: Confirm New Password
fr: Confirmer le nouveau mot de passe

# newPasswordFormConfirmHint
source: Confirm your new password
fr: Confirmez votre nouveau mot de passe

# newPasswordFormConfirmErrorRequired
source: Please confirm your new password
fr: Veuillez confirmer votre nouveau mot de passe

# newPasswordFormSubmitButton
source: Change Password
fr: Changer le mot de passe

# leftPanelSetNewPasswordTitle
source: Secure Your Account
fr: Sécurisez Votre Compte

# leftPanelSetNewPasswordSubtitle
source: Choose a strong, unique password to protect your hotel management data.
fr: Choisissez un mot de passe fort et unique pour protéger les données de gestion de votre hôtel.

# leftPanelSetNewPasswordHighlight1Title
source: Strong Password
fr: Mot de Passe Fort

# leftPanelSetNewPasswordHighlight1Description
source: Use a mix of letters, numbers, and symbols for better security.
fr: Utilisez un mélange de lettres, de chiffres et de symboles pour une meilleure sécurité.

# leftPanelSetNewPasswordHighlight2Title
source: Avoid Reuse
fr: Évitez la Réutilisation

# leftPanelSetNewPasswordHighlight2Description
source: Don't use passwords you've used on other sites.
fr: N'utilisez pas de mots de passe que vous avez utilisés sur d'autres sites.

# leftPanelSetNewPasswordHighlight3Description
source: Ensure your new password is confirmed энергия (energy) and saved securely.
fr: Assurez-vous que votre nouveau mot de passe est confirmé et enregistré en toute sécurité.

# setNewPasswordTitle
source: Set New Password
fr: Définir un Nouveau Mot de Passe

# setNewPasswordSubtitle
source: Create a new secure password for your account associated with {email}.
fr: Créez un nouveau mot de passe sécurisé pour votre compte associé à {email}.

# forgotPasswordEmailVerificationLoadingMessage
source: Verifying email...
fr: Vérification de l'e-mail en cours...

# forgotPasswordOtpVerificationLoadingMessage
source: Verifying OTP...
fr: Vérification de l'OTP en cours...

# forgotPasswordChangeLoadingMessage
source: Updating password...
fr: Mise à jour du mot de passe en cours...

# settingsTitle
source: Settings
fr: Paramètres

# settingsSubtitle
source: Manage your preferences and system settings
fr: Gérez vos préférences et paramètres système

# backButton
source: Back
fr: Retour

# accountTab
source: Account
fr: Compte

# appearanceTab
source: Appearance
fr: Apparence

# userInfoTitle
source: User Information
fr: Informations utilisateur

# userInfoSubtitle
source: Basic information about your account and user preferences
fr: Informations de base sur votre compte et vos préférences utilisateur

# appearanceContentPlaceholder
source: Appearance Content Here
fr: Contenu de l'apparence ici

# activeSessionDialogTitle
source: Active Session Detected
fr: Session Active Détectée

# activeSessionDialogMessage
source: You already have an active session on another device or browser. Do you want to close the previous session and continue with the current login?
fr: Vous avez déjà une session active sur un autre appareil ou navigateur. Voulez-vous fermer la session précédente et continuer avec la connexion actuelle?

# keepSessionButtonLabel
source: Keep Session
fr: Conserver la Session

# closeSessionButtonLabel
source: Close Previous Session
fr: Fermer la Session Précédente

# invalidOtpMessage
source: The code you entered is not valid. Please check it and try again.
fr: Le code que vous avez saisi n’est pas valide. Veuillez vérifier et réessayer.

# logoutConfirmTitle
source: Sign Out
fr: Se déconnecter

# logoutConfirmMessage
source: Are you sure you want to sign out? You will need to sign in again to access the system.
fr: Êtes-vous sûr de vouloir vous déconnecter ? Vous devrez vous reconnecter pour accéder au système.

# logout
source: Sign Out
fr: Se déconnecter

source: Cancel
fr: Annuler

# passwordRecoveryErrorTitle
source: Email Not Found
fr: E-mail non trouvé

# passwordRecoveryErrorMessage
source: This email address is not registered in the system. Please verify and try again.
fr: Cette adresse e-mail n'est pas enregistrée dans le système. Veuillez vérifier et réessayer.

# accept
source: Understood
fr: Compris

# accountBlockedTitle
source: Account Temporarily Blocked
fr: Compte temporairement bloqué

# accountBlockedMessage
source: Your account has been temporarily blocked for security reasons. Please try again after 2 hours or contact the administrator if you need immediate assistance.
fr: Votre compte a été temporairement bloqué pour des raisons de sécurité. Veuillez réessayer après 2 heures ou contactez l'administrateur si vous avez besoin d'une assistance immédiate.

# invalidCredentialsTitle
source: Invalid Credentials
fr: Identifiants incorrects

# invalidCredentialsMessage
source: Incorrect username or password. Please verify your information and try again.
fr: Nom d'utilisateur ou mot de passe incorrect. Veuillez vérifier vos informations et réessayer.

# userAlreadyExistsTitle
source: User Already Exists
fr: Utilisateur déjà existant

# emailAlreadyRegisteredError
source: User already exists, please sign in.
fr: L'utilisateur existe déjà, veuillez vous connecter.

# passwordMismatchTitle
source: Passwords Don't Match
fr: Les mots de passe ne correspondent pas

# passwordMismatchMessage
source: The passwords entered do not match. Please verify and try again.
fr: Les mots de passe saisis ne correspondent pas. Veuillez vérifier et réessayer.

# registrationErrorTitle
source: Registration Error
fr: Erreur d'inscription

# registrationErrorMessage
source: Could not complete the registration. Please try again.
fr: Impossible de terminer l'inscription. Veuillez réessayer.

# otpVerificationErrorTitle
source: Incorrect Code
fr: Code incorrect

# autoLoginFailedTitle
source: Auto Login Failed
fr: Échec de la connexion automatique

# formValidationErrorTitle
source: Incomplete Form
fr: Formulaire incomplet

# googleSignInCancelledTitle
source: Registration Cancelled
fr: Inscription annulée

# passwordChangeSuccessTitle
source: Password Updated
fr: Mot de passe mis à jour

# emailNotProvidedErrorTitle
source: Email Required
fr: E-mail requis

# otpVerificationSuccessTitle
source: Code Verified
fr: Code vérifié

# operationErrorTitle
source: Error
fr: Erreur

# authLoginErrorTitle
source: Authentication Error
fr: Erreur d'authentification

# googleLoginErrorTitle
source: Google Error
fr: Erreur Google

# loginSuccessTitle
source: Welcome!
fr: Bienvenue !

# loginSuccessMessage
source: You have successfully signed in. Redirecting to the system...
fr: Vous vous êtes connecté avec succès. Redirection vers le système...

# loginSuccessGoogleMessage
source: Google sign-in successful. Accessing the system...
fr: Connexion Google réussie. Accès au système...

# returnToLoginTitle
source: Going Back
fr: Retour en arrière

# returnToLoginMessage
source: Returning to the login screen.
fr: Retour à l'écran de connexion.

# deleteAccountTitle
source: Delete Account
fr: Supprimer le compte

# deleteAccountMessage
source: Are you sure? This action is irreversible and all your data will be permanently deleted.
fr: Êtes-vous sûr ? Cette action est irréversible et toutes vos données seront définitivement supprimées.

# deleteConfirm
source: Yes, Delete
fr: Oui, supprimer

# accountDeletedSuccessTitle
source: Account Deleted
fr: Compte supprimé

# userIdNotAvailableError
source: User ID not available to delete the account.
fr: Identifiant utilisateur non disponible pour supprimer le compte.
